## DataFrames:
- it is two dimensional data structure
- for creating DF we have few ways
    - using array
    - using list
    - Series
    - dict

In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.arange(1,6)
arr

array([1, 2, 3, 4, 5])

In [3]:
df = pd.DataFrame(arr)
df

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
names = ['abdul','gokul','upendra','sai','sri']
rollnos = [501,502,503,504,505]

In [9]:
df1 = pd.DataFrame(names)
df1[1]=rollnos

In [10]:
df1

         0    1
0    abdul  501
1    gokul  502
2  upendra  503
3      sai  504
4      sri  505

In [11]:
sr = pd.Series(names)
sr

0      abdul
1      gokul
2    upendra
3        sai
4        sri
dtype: object

In [12]:
df3 = pd.DataFrame(sr)
df3

         0
0    abdul
1    gokul
2  upendra
3      sai
4      sri

In [13]:
d1 = dict(zip(names,rollnos))
d1

{'abdul': 501, 'gokul': 502, 'upendra': 503, 'sai': 504, 'sri': 505}

In [14]:
d2 = {'Names':names,'Roll Nos':rollnos}
d2

{'Names': ['abdul', 'gokul', 'upendra', 'sai', 'sri'],
 'Roll Nos': [501, 502, 503, 504, 505]}

In [15]:
dframe = pd.DataFrame(d2)
dframe

     Names  Roll Nos
0    abdul       501
1    gokul       502
2  upendra       503
3      sai       504
4      sri       505

In [17]:
dframe.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
dframe.columns

Index(['Names', 'Roll Nos'], dtype='object')

In [19]:
df1 = pd.DataFrame(d2,index=[1,2,3,4,5])

In [20]:
df1

     Names  Roll Nos
1    abdul       501
2    gokul       502
3  upendra       503
4      sai       504
5      sri       505

In [21]:
srnames=pd.Series(names)
srrollnos=pd.Series(rollnos)
srnames,srrollnos

(0      abdul
 1      gokul
 2    upendra
 3        sai
 4        sri
 dtype: object, 0    501
 1    502
 2    503
 3    504
 4    505
 dtype: int64)

In [31]:
df = pd.DataFrame({'Names':srnames,'Roll Nos':rollnos})

In [32]:
df

     Names  Roll Nos
0    abdul       501
1    gokul       502
2  upendra       503
3      sai       504
4      sri       505

In [33]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
df.columns

Index(['Names', 'Roll Nos'], dtype='object')

In [36]:
df['Names']

0      abdul
1      gokul
2    upendra
3        sai
4        sri
Name: Names, dtype: object

In [37]:
df['Roll Nos']

0    501
1    502
2    503
3    504
4    505
Name: Roll Nos, dtype: int64

In [38]:
df['Roll Nos'][3]

504

In [39]:
df['Roll Nos'][1:4]

1    502
2    503
3    504
Name: Roll Nos, dtype: int64

In [41]:
df.loc[0]

Names       abdul
Roll Nos      501
Name: 0, dtype: object

In [44]:
df.iloc[0]

Names       abdul
Roll Nos      501
Name: 0, dtype: object

In [45]:
df

     Names  Roll Nos
0    abdul       501
1    gokul       502
2  upendra       503
3      sai       504
4      sri       505

In [46]:
df['Branch']=('CSE','ECE','EEE','IT','CSE')
df

     Names  Roll Nos Branch
0    abdul       501    CSE
1    gokul       502    ECE
2  upendra       503    EEE
3      sai       504     IT
4      sri       505    CSE

In [53]:
df1 = df.set_index('Names')

In [54]:
df1

         Roll Nos Branch
Names
abdul         501    CSE
gokul         502    ECE
upendra       503    EEE
sai           504     IT
sri           505    CSE

In [55]:
df1.index

Index(['abdul', 'gokul', 'upendra', 'sai', 'sri'], dtype='object', name='Names')

In [56]:
df1.columns

Index(['Roll Nos', 'Branch'], dtype='object')

In [57]:
df1['Branch']

Names
abdul      CSE
gokul      ECE
upendra    EEE
sai         IT
sri        CSE
Name: Branch, dtype: object

In [58]:
df1.loc['abdul']

Roll Nos    501
Branch      CSE
Name: abdul, dtype: object

In [60]:
df1.iloc[1]

Roll Nos    502
Branch      ECE
Name: gokul, dtype: object

In [61]:
df1.iloc[[1,3]]

       Roll Nos Branch
Names
gokul       502    ECE
sai         504     IT

In [62]:
df1['Scolarship']=[500,800,600,900,1000]

In [63]:
df1

         Roll Nos Branch  Scolarship
Names
abdul         501    CSE         500
gokul         502    ECE         800
upendra       503    EEE         600
sai           504     IT         900
sri           505    CSE        1000

In [65]:
df1['Scolarship'].max()

1000

In [66]:
df1['Scolarship'].min()

500

In [67]:
df1['Scolarship'].sum()

3800

In [68]:
df1.tail(2)

       Roll Nos Branch  Scolarship
Names
sai         504     IT         900
sri         505    CSE        1000

In [70]:
df1.tail(2)['Scolarship'].sum()

1900

In [71]:
df1['Scolarship'].argmax()

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  """Entry point for launching an IPython kernel.

'sri'

In [76]:
# create a dataframe for student marks
# RoolNo Name Python Java C CPP Android PHP
# 501    Abdul 100  89   78 45 74 89

d1 = {'Names':['Abdul','Raju','Siva','Sunil','Aravind'],
     'Rollnos':np.arange(501,506),
     'Python':np.random.randint(0,100,5),
     'Java':np.random.randint(0,100,5),
     'C':np.random.randint(0,100,5),
     'CPP':np.random.randint(0,100,5),
     'Android':np.random.randint(0,100,5),
     'PHP':np.random.randint(0,100,5)}

In [77]:
d1

{'Names': ['Abdul', 'Raju', 'Siva', 'Sunil', 'Aravind'],
 'Rollnos': array([501, 502, 503, 504, 505]),
 'Python': array([98, 47, 10, 54, 19]),
 'Java': array([20, 64, 53, 61, 81]),
 'C': array([24, 72, 58, 19, 25]),
 'CPP': array([81, 51, 52, 91, 40]),
 'Android': array([41, 69,  8, 93, 37]),
 'PHP': array([18, 12, 60, 41, 56])}

In [78]:
data = pd.DataFrame(d1)

In [79]:
data

     Names  Rollnos  Python  Java   C  CPP  Android  PHP
0    Abdul      501      98    20  24   81       41   18
1     Raju      502      47    64  72   51       69   12
2     Siva      503      10    53  58   52        8   60
3    Sunil      504      54    61  19   91       93   41
4  Aravind      505      19    81  25   40       37   56

In [99]:
# make rollno as index
data.set_index('Rollnos')

           Names  Python  Java   C  CPP  Android  PHP  Total_scores
Rollnos
501        Abdul      98    20  24   81       41   18           783
502         Raju      47    64  72   51       69   12           817
503         Siva      10    53  58   52        8   60           744
504        Sunil      54    61  19   91       93   41           863
505      Aravind      19    81  25   40       37   56           763

In [105]:
# find out total sum of scores then keep it in new column
#data[['Python','Java','C','CPP','Android','PHP']]
total_scores=[]
for i in range(len(data.index)):
    total_scores.append(data.iloc[i][2:8].sum())

In [106]:
total_scores

[282, 315, 241, 359, 258]

In [107]:
data['Total_scores']=total_scores

In [108]:
data

     Names  Rollnos  Python  Java   C  CPP  Android  PHP  Total_scores
0    Abdul      501      98    20  24   81       41   18           282
1     Raju      502      47    64  72   51       69   12           315
2     Siva      503      10    53  58   52        8   60           241
3    Sunil      504      54    61  19   91       93   41           359
4  Aravind      505      19    81  25   40       37   56           258

In [92]:
data.iloc[0][1:].sum()

783

In [111]:
data = data.set_index('Names')

In [112]:
data

         Rollnos  Python  Java   C  CPP  Android  PHP  Total_scores
Names
Abdul        501      98    20  24   81       41   18           282
Raju         502      47    64  72   51       69   12           315
Siva         503      10    53  58   52        8   60           241
Sunil        504      54    61  19   91       93   41           359
Aravind      505      19    81  25   40       37   56           258

In [113]:
# now i want know toper name
data['Total_scores'].argmax()

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.

'Sunil'

In [114]:
data['Total_scores'].idxmax()

'Sunil'